Revit 2024 API
MetallicpaintPearlType Enumeration
 The enumerated type representing the permitted values for the asset property "MetallicpaintPearl" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum MetallicpaintPearlType
Visual Basic
Public Enumeration MetallicpaintPearlType
Visual C++
public enum class MetallicpaintPearlType
Members
Member name | Description
None
Chromatic
Custom
See Also
Autodesk.Revit.DB.Visual Namespace